os/paperwork/os-syllabus.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
               "http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="cn" xml:lang="cn">
<head>
<title>《操作系统原理》课程大纲</title>
<meta http-equiv="Content-Type" content="text/html;charset=utf-8"/>
<meta name="title" content="《操作系统原理》课程大纲"/>
<meta name="generator" content="Org-mode"/>
<meta name="generated" content="2014-03-13T10:28+0800"/>
<meta name="author" content="王晓林"/>
<meta name="description" content=""/>
<meta name="keywords" content=""/>
<link rel="stylesheet" href="http://cs2.swfu.edu.cn/org-info-js/org-manual.css" type="text/css">

</head>
<body>

<div id="preamble">

</div>

<div id="content">
<h1 class="title">《操作系统原理》课程大纲</h1>

<ul>
<li>课程编号: A05025, A05026
</li>
<li>学时: 64 (理论: 48; 实验: 16)
</li>
<li>学分: 3
</li>
<li>实习: 0
</li>
<li>面向专业: 计算机科学与技术，电子信息工程，信息与计算机技术
</li>
</ul>



<div id="table-of-contents">
<h2>目录</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#sec-1">1 课程大纲</a>
<ul>
<li><a href="#sec-1-1">1.1 课程内容</a></li>
<li><a href="#sec-1-2">1.2 实验内容</a></li>
<li><a href="#sec-1-3">1.3 实习</a></li>
<li><a href="#sec-1-4">1.4 考核</a></li>
<li><a href="#sec-1-5">1.5 参考教材</a></li>
</ul>
</li>
<li><a href="#sec-2">2 课程说明</a>
<ul>
<li><a href="#sec-2-1">2.1 课程性质和要求</a></li>
<li><a href="#sec-2-2">2.2 课程重点</a></li>
<li><a href="#sec-2-3">2.3 作业、实习要求</a></li>
<li><a href="#sec-2-4">2.4 与其它课程的关系</a></li>
<li><a href="#sec-2-5">2.5 课时安排</a></li>
<li><a href="#sec-2-6">2.6 特殊说明</a></li>
</ul>
</li>
<li><a href="#sec-3">3 实验教学大纲</a>
<ul>
<li><a href="#sec-3-1">3.1 实验教学的目的和要求</a></li>
<li><a href="#sec-3-2">3.2 实践教学大纲</a></li>
<li><a href="#sec-3-3">3.3 实验设备要求</a></li>
<li><a href="#sec-3-4">3.4 实验内容</a>
<ul>
<li><a href="#sec-3-4-1">3.4.1 Approaching to the Linux kernel (4h)</a></li>
<li><a href="#sec-3-4-2">3.4.2 Process Management (4h)</a></li>
<li><a href="#sec-3-4-3">3.4.3 Memory management (4h)</a></li>
<li><a href="#sec-3-4-4">3.4.4 File System (4h)</a></li>
</ul>
</li>
<li><a href="#sec-3-5">3.5 实验报告要求</a></li>
<li><a href="#sec-3-6">3.6 成绩考核</a></li>
<li><a href="#sec-3-7">3.7 实验指导和参考书目</a></li>
<li><a href="#sec-3-8">3.8 特别说明</a></li>
</ul>
</li>
<li><a href="#sec-4">4 课程简介</a></li>
</ul>
</div>
</div>

<div id="outline-container-1" class="outline-2">
<h2 id="sec-1"><span class="section-number-2">1</span> 课程大纲</h2>
<div class="outline-text-2" id="text-1">


</div>

<div id="outline-container-1-1" class="outline-3">
<h3 id="sec-1-1"><span class="section-number-3">1.1</span> 课程内容</h3>
<div class="outline-text-3" id="text-1-1">

<ol>
<li>Introduction
<ul>
<li>What's an OS?
</li>
<li>OS services
</li>
<li>Bootstrapping
</li>
<li>Hardware
</li>
<li>Interrupt
</li>
<li>System calls
</li>
</ul>

</li>
<li>Processes and Threads
<ul>
<li>What's a process?
</li>
<li>Process creation
</li>
<li>Process state
</li>
<li>Process Control Block (PCB)
</li>
<li>CPU switch from process to process
</li>
<li>Processes vs. threads
</li>
<li>Why threads?
</li>
<li>Thread characteristics
</li>
<li>Thread operation and POSIX threads
</li>
<li>User-level threads vs. kernel-level threads
</li>
<li>Linux threads
</li>
</ul>

</li>
<li>Process synchronization
<ul>
<li>Concepts
</li>
<li>Shared memory
</li>
<li>Race condition and mutual exclusion
</li>
<li>Semaphores
</li>
<li>Monitors
</li>
<li>Message passing
</li>
<li>Classical IPC problems
</li>
</ul>

</li>
<li>CPU Scheduling
<ul>
<li>Scheduling introduction
</li>
<li>Scheduling algorithms
</li>
<li>Thread scheduling
</li>
<li>Linux scheduling
</li>
</ul>

</li>
<li>Deadlocks
<ul>
<li>Resources
</li>
<li>Introduction to deadlocks
</li>
<li>Deadlock modeling
</li>
<li>Dealing with deadlocks
</li>
</ul>

</li>
<li>Memory Management
<ul>
<li>Real-mode vs. protected-mode memory management
</li>
<li>Contiguous memory allocation
</li>
<li>Virtual memory
</li>
</ul>

</li>
<li>File Systems
<ul>
<li>Files
</li>
<li>Directories
</li>
<li>File system implementation
</li>
<li>Ext2 file system
</li>
<li>Virtual file system
</li>
</ul>

</li>
</ol>

</div>

</div>

<div id="outline-container-1-2" class="outline-3">
<h3 id="sec-1-2"><span class="section-number-3">1.2</span> 实验内容</h3>
<div class="outline-text-3" id="text-1-2">

<p>   参见《操作系统原理实验教学大纲》。
</p></div>

</div>

<div id="outline-container-1-3" class="outline-3">
<h3 id="sec-1-3"><span class="section-number-3">1.3</span> 实习</h3>
<div class="outline-text-3" id="text-1-3">

<p>   无
</p></div>

</div>

<div id="outline-container-1-4" class="outline-3">
<h3 id="sec-1-4"><span class="section-number-3">1.4</span> 考核</h3>
<div class="outline-text-3" id="text-1-4">

<ul>
<li>考试: 80%
</li>
<li>作业: 20%
</li>
</ul>

</div>

</div>

<div id="outline-container-1-5" class="outline-3">
<h3 id="sec-1-5"><span class="section-number-3">1.5</span> 参考教材</h3>
<div class="outline-text-3" id="text-1-5">

<ol>
<li>A.S. Tanenbaum. Modern Operating Systems, 3e. Pearson Prentice Hall, 2008. 
</li>
<li>Silberschatz, Galvin, and Gagne. Operating System Concepts Essentials. John Wiley &amp; Sons, 2011.
</li>
<li>D.P. Bovet and M. Cesatí. Understanding The Linux Kernel. O'Reilly, 2005.
</li>
</ol>


</div>
</div>

</div>

<div id="outline-container-2" class="outline-2">
<h2 id="sec-2"><span class="section-number-2">2</span> 课程说明</h2>
<div class="outline-text-2" id="text-2">


</div>

<div id="outline-container-2-1" class="outline-3">
<h3 id="sec-2-1"><span class="section-number-3">2.1</span> 课程性质和要求</h3>
<div class="outline-text-3" id="text-2-1">

<p>   《操作系统原理》是一门重要的专业基础课。深入理解操作系统的工作原理对学生在软件编程、开
   发方面具有重大意义。 本课程介绍给同学如下内容：
</p><ul>
<li>操作系统简介
</li>
<li>进程与线程
</li>
<li>进程间通信
</li>
<li>CPU调度
</li>
<li>死锁
</li>
<li>内存管理
</li>
<li>文件系统
</li>
</ul>

</div>

</div>

<div id="outline-container-2-2" class="outline-3">
<h3 id="sec-2-2"><span class="section-number-3">2.2</span> 课程重点</h3>
<div class="outline-text-3" id="text-2-2">

<ul>
<li>进程
</li>
<li>内存管理
</li>
<li>文件系统
</li>
</ul>

</div>

</div>

<div id="outline-container-2-3" class="outline-3">
<h3 id="sec-2-3"><span class="section-number-3">2.3</span> 作业、实习要求</h3>
<div class="outline-text-3" id="text-2-3">

<p>   按时交作业。
</p></div>

</div>

<div id="outline-container-2-4" class="outline-3">
<h3 id="sec-2-4"><span class="section-number-3">2.4</span> 与其它课程的关系</h3>
<div class="outline-text-3" id="text-2-4">

<ul>
<li>前期课程：计算机组成原理，Linux应用基础，C编程，汇编编程
</li>
<li>后期课程：Linux系统分析
</li>
</ul>

</div>

</div>

<div id="outline-container-2-5" class="outline-3">
<h3 id="sec-2-5"><span class="section-number-3">2.5</span> 课时安排</h3>
<div class="outline-text-3" id="text-2-5">

<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">
<colgroup><col class="left" /><col class="right" /><col class="right" />
</colgroup>
<thead>
<tr><th scope="col" class="left">课程内容</th><th scope="col" class="right">理论学时</th><th scope="col" class="right">实验学时</th></tr>
</thead>
<tbody>
<tr><td class="left">简介</td><td class="right">4</td><td class="right">2</td></tr>
<tr><td class="left">进程与线程</td><td class="right">8</td><td class="right">2.5</td></tr>
<tr><td class="left">进程间同步</td><td class="right">10</td><td class="right">2.5</td></tr>
<tr><td class="left">CPU调度</td><td class="right">4</td><td class="right">0.5</td></tr>
<tr><td class="left">死锁</td><td class="right">4</td><td class="right">0.5</td></tr>
<tr><td class="left">内存管理</td><td class="right">9</td><td class="right">4</td></tr>
<tr><td class="left">文件系统</td><td class="right">9</td><td class="right">4</td></tr>
</tbody>
</table>

</div>

</div>

<div id="outline-container-2-6" class="outline-3">
<h3 id="sec-2-6"><span class="section-number-3">2.6</span> 特殊说明</h3>
<div class="outline-text-3" id="text-2-6">

<p>   无
</p></div>
</div>

</div>

<div id="outline-container-3" class="outline-2">
<h2 id="sec-3"><span class="section-number-2">3</span> 实验教学大纲</h2>
<div class="outline-text-2" id="text-3">

<ul>
<li>课程编号: A05025, A05026
</li>
<li>学时: 64 (理论: 48; 实验: 16)
</li>
<li>学分: 3
</li>
<li>实习: 0
</li>
<li>授课对象: 计算机科学与技术，电子信息工程，信息与计算机技术
</li>
</ul>


</div>

<div id="outline-container-3-1" class="outline-3">
<h3 id="sec-3-1"><span class="section-number-3">3.1</span> 实验教学的目的和要求</h3>
<div class="outline-text-3" id="text-3-1">

<p>   通过编程实践，让学生深入了解操作系统的工作原理
</p></div>

</div>

<div id="outline-container-3-2" class="outline-3">
<h3 id="sec-3-2"><span class="section-number-3">3.2</span> 实践教学大纲</h3>
<div class="outline-text-3" id="text-3-2">

<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">
<colgroup><col class="left" /><col class="right" />
</colgroup>
<thead>
<tr><th scope="col" class="left">实验安排</th><th scope="col" class="right">学时</th></tr>
</thead>
<tbody>
<tr><td class="left">了解Linux内核</td><td class="right">4</td></tr>
<tr><td class="left">进程管理</td><td class="right">4</td></tr>
<tr><td class="left">内存管理</td><td class="right">4</td></tr>
<tr><td class="left">文件系统</td><td class="right">4</td></tr>
</tbody>
</table>


</div>

</div>

<div id="outline-container-3-3" class="outline-3">
<h3 id="sec-3-3"><span class="section-number-3">3.3</span> 实验设备要求</h3>
<div class="outline-text-3" id="text-3-3">

<ul>
<li>Debian/Ubuntu PC
</li>
</ul>

</div>

</div>

<div id="outline-container-3-4" class="outline-3">
<h3 id="sec-3-4"><span class="section-number-3">3.4</span> 实验内容</h3>
<div class="outline-text-3" id="text-3-4">

<ul>
<li>参见<a href="http://cs3.swfu.edu.cn/moodle/mod/url/view.php?id=1046">《操作系统原理实验指导》</a>。
</li>
</ul>


</div>

<div id="outline-container-3-4-1" class="outline-4">
<h4 id="sec-3-4-1"><span class="section-number-4">3.4.1</span> Approaching to the Linux kernel (4h)</h4>
<div class="outline-text-4" id="text-3-4-1">

<ul>
<li id="sec-3-4-1-1">proc file-system<br/>
</li>
</ul>
<ul>
<li id="sec-3-4-1-2">Play with the kernel<br/>
</li>
</ul>
<ul>
<li id="sec-3-4-1-3">Hello, kernel module!<br/>
</li>
</ul>
<ul>
<li id="sec-3-4-1-4">System calls<br/>
</li>
</ul>
</div>

</div>

<div id="outline-container-3-4-2" class="outline-4">
<h4 id="sec-3-4-2"><span class="section-number-4">3.4.2</span> Process Management (4h)</h4>
<div class="outline-text-4" id="text-3-4-2">

<ul>
<li id="sec-3-4-2-1">Process creation<br/>
</li>
</ul>
<ul>
<li id="sec-3-4-2-2">Thread<br/>
</li>
</ul>
<ul>
<li id="sec-3-4-2-3">IPC<br/>
<ul>
<li id="sec-3-4-2-3-1">Signals<br/>
</li>
</ul>
<ul>
<li id="sec-3-4-2-3-2">Pipe<br/>
</li>
</ul>
<ul>
<li id="sec-3-4-2-3-3">FIFO<br/>
</li>
</ul>
<ul>
<li id="sec-3-4-2-3-4">File Locking<br/>
</li>
</ul>
<ul>
<li id="sec-3-4-2-3-5">Message Queues<br/>
</li>
</ul>
<ul>
<li id="sec-3-4-2-3-6">Semaphores<br/>
</li>
</ul>
</li>
</ul>
</div>

</div>

<div id="outline-container-3-4-3" class="outline-4">
<h4 id="sec-3-4-3"><span class="section-number-4">3.4.3</span> Memory management (4h)</h4>
<div class="outline-text-4" id="text-3-4-3">

<ul>
<li id="sec-3-4-3-1">Basic commands<br/>
</li>
</ul>
<ul>
<li id="sec-3-4-3-2">Shared Memory Segments<br/>
</li>
</ul>
<ul>
<li id="sec-3-4-3-3">Memory Mapped Files<br/>
</li>
</ul>
</div>

</div>

<div id="outline-container-3-4-4" class="outline-4">
<h4 id="sec-3-4-4"><span class="section-number-4">3.4.4</span> File System (4h)</h4>
<div class="outline-text-4" id="text-3-4-4">

<ul>
<li id="sec-3-4-4-1">File system creation<br/>
</li>
</ul>
<ul>
<li id="sec-3-4-4-2">Finding a file with <code>hexdump</code><br/>

</li>
</ul>
</div>
</div>

</div>

<div id="outline-container-3-5" class="outline-3">
<h3 id="sec-3-5"><span class="section-number-3">3.5</span> 实验报告要求</h3>
<div class="outline-text-3" id="text-3-5">

<p>   按规定格式完成，不得延误
</p></div>

</div>

<div id="outline-container-3-6" class="outline-3">
<h3 id="sec-3-6"><span class="section-number-3">3.6</span> 成绩考核</h3>
<div class="outline-text-3" id="text-3-6">

<ul>
<li>实验报告满分100，60分及格
</li>
</ul>

</div>

</div>

<div id="outline-container-3-7" class="outline-3">
<h3 id="sec-3-7"><span class="section-number-3">3.7</span> 实验指导和参考书目</h3>
<div class="outline-text-3" id="text-3-7">

<ol>
<li>自编<a href="http://cs3.swfu.edu.cn/moodle/mod/url/view.php?id=1046">《实验指导》</a>
</li>
<li>A.S. Tanenbaum. Modern Operating Systems, 3e. Pearson Prentice Hall, 2008. 
</li>
<li>Silberschatz, Galvin, and Gagne. Operating System Concepts Essentials. John Wiley &amp; Sons, 2011.
</li>
<li>D.P. Bovet and M. Cesatí. Understanding The Linux Kernel. O'Reilly, 2005.
</li>
</ol>


</div>

</div>

<div id="outline-container-3-8" class="outline-3">
<h3 id="sec-3-8"><span class="section-number-3">3.8</span> 特别说明</h3>
<div class="outline-text-3" id="text-3-8">

<p>   无
</p>
</div>
</div>

</div>

<div id="outline-container-4" class="outline-2">
<h2 id="sec-4"><span class="section-number-2">4</span> 课程简介</h2>
<div class="outline-text-2" id="text-4">

<ul>
<li>课程编号: A05025, A05026
</li>
<li>学时: 64 (理论: 48; 实验: 16)
</li>
<li>学分: 3
</li>
<li>实习: 0
</li>
<li>面向专业: 计算机科学与技术，电子信息工程，信息与计算机技术
</li>
<li>前期课程：英语，计算机组成原理，Linux应用基础，C编程，汇编知识
</li>
<li>课程性质和要求
   《操作系统原理》是一门重要的专业基础课。深入理解操作系统的工作原理对学生在软件编程、开
   发方面具有重大意义。 本课程介绍给同学如下内容：
<ul>
<li>操作系统简介
</li>
<li>进程与线程
</li>
<li>进程间通信
</li>
<li>CPU调度
</li>
<li>死锁
</li>
<li>内存管理
</li>
<li>文件系统
</li>
</ul>

</li>
<li>参考教材
<ol>
<li>A.S. Tanenbaum. Modern Operating Systems, 3e. Pearson Prentice Hall, 2008. 
</li>
<li>Silberschatz, Galvin, and Gagne. Operating System Concepts Essentials. John Wiley &amp; Sons, 2011.
</li>
<li>D.P. Bovet and M. Cesatí. Understanding The Linux Kernel. O'Reilly, 2005.
</li>
</ol>

</li>
</ul>




</div>
</div>
</div>

<div id="postamble">
<p class="author">Author: 王晓林 (<a href="mailto:wx672ster@gmail.com">wx672ster@gmail.com</a>)</p>
<p class="date">Date: 2014-03-13T10:28+0800</p>

</div>
</body>
</html>
